Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_fr.ditamap.xlf.tmx
Source language: en
Languages: fr

source: A progress dialog is displayed while duplicated units are removed. The editing window is refreshed to reflect the changes.
fr: Un petit message s’affiche pendant le traitement. Les données du fichier nettoyé apparaissent dans la fenêtre principale.

source: Remove Language
fr: Supprimer une langue

source: Follow these steps to remove a language from a TMX file.
fr: Voici les étapes à suivre pour supprimer tous les textes d’une langue dans un fichier TMX.

source: In main menu, select Tasks Remove Language... option.
fr: Dans le menu, sélectionnez Tâches Supprimer une langue .

source: Remove Language Dialog
fr: Boîte de dialogue "Supprimer une langue"

source: Use the drop-down box to select the language to remove.
fr: Sélectionnez la langue à supprimer à l’aide de la liste déroulante.

source: Click the Remove Language button.
fr: Cliquez sur le bouton Supprimer la langue .

source: Remove Translation Same as Source
fr: Supprimer les traductions identiques à la source

source: Follow these steps to remove translation entries that are the same as source entry from a TMX file.
fr: Marche à suivre pour supprimer les traductions qui sont identiques au texte source dans un fichier TMX.

source: The editing window is refreshed to reflect the changes.
fr: Les données du fichier nettoyé apparaissent dans la fenêtre principale.

source: Translation units may contain one or more language entries that are equal to the entry designated as source. If in a given unit all entries have the same content, this procedure removes the entire unit. If at least one language entry is different from source, the unit is preserved containing only translations that are different from source.
fr: Certaines unités de traduction peuvent contenir des traductions qui sont identiques au texte en langue source. Ce traitement supprime les unités de traductions dont le texte est le même dans toutes les langues. Il supprime également les traductions qui sont identiques à la source (tout en laissant dans l’unité de traduction toutes les traductions qui diffèrent).

source: In main menu, select Tasks Remove Translation Same as Source... option.
fr: Dans le menu, sélectionnez Tâches Supprimer les traductions identiques à la source .

source: Remove Translation Same as Source Dialog
fr: Boîte de dialogue "Supprimer les traductions identiques à la source"

source: Use the Source Language drop-down to select the language to be considered language for removing units (it may differ from the source language set at file level).
fr: À l’aide de la liste déroulante Langue source , sélectionnez la langue devant être considérée comme la langue source pour ce traitement. (Cette langue n’est pas forcément la même que la langue source définie au niveau du fichier.)

source: Click the Remove Translation Same as Source button.
fr: Cliquez sur le bouton Supprimer les traductions identiques à la source .

source: A progress dialog is displayed while translation enties that are equal to source are removed.
fr: Un petit message s’affiche pendant le traitement.

source: Remove Initial & Trailing Spaces
fr: Supprimer les espaces à gauche et à droite

source: Follow these steps to remove initial and trailing spaces from all segments of a TMX file.
fr: Marche à suivre pour supprimer les espaces qui se trouvent au début ou à la fin des segments d’un fichier TMX.

source: Leading or trailing spaces may affect the match quality rating of matches retrieved from a translation memory system.
fr: Les espaces superflus peuvent fausser les pourcentages de correspondance calculés par les systèmes à mémoire de traduction.

source: In main menu, select Tasks Remove Initial/Trailing Spaces .
fr: Dans le menu, sélectionnez Tâches Supprimer les espaces à gauche et à droite .

source: A progress dialog is displayed while spaces are removed. The editing window is refreshed to reflect the changes.
fr: Un petit message s’affiche pendant le traitement. Les données du fichier nettoyé apparaissent dans la fenêtre principale.

source: Remove Inline Tags
fr: Supprimer les balises inline

source: Follow these steps to remove inline tags from a TMX file.
fr: Marche à suivre pour supprimer toutes les balises inline d’un fichier TMX.

source: The presence of inline tags may have an adverse effect when retrieving TM matches if a penalty is applied for missing or differences in inline tags.
fr: La présence de balises inline est susceptible de perturber la recherche de correspondances si une pénalité est appliquée lorsque les balises ne coïncident pas exactement.

source: Open the TMX file that you want to process.
fr: Ouvrez le fichier TMX à nettoyer.

source: In main menu, select Tasks Remove All Tags .
fr: Dans le menu, sélectionnez Tâches Supprimer les balises inline .

source: A progress dialog is displayed while inline tags are removed. The editing window is refreshed to reflect the changes.
fr: Un petit message s’affiche pendant le traitement. Les données du fichier nettoyé apparaissent dans la fenêtre principale.

source: Remove Untranslated Units
fr: Supprimer les unités non traduites

source: Follow these steps to remove untranslated units from a TMX file.
fr: Marche à suivre pour supprimer les unités non traduites d’un fichier TMX.

source: A translation unit that has just one <tuv> element that contains text is considered "untranslated". Untranslated units are hardly useful for retrieving matches from a Translation Memory system.
fr: Une unité de traduction est dite « non traduite » si elle ne contient qu’une seule balise <tuv> avec du texte dedans. Les unités non traduites ne fournissent aucune correspondance aux systèmes à mémoire de traduction .

source: In main menu, seect Tasks Remove Untranslated Units... .
fr: Dans le menu, sélectionnez Tâches Supprimer les unités non traduites. .

source: Remove Untranslated Units Dialog
fr: Boîte de dialogue "Supprimer les unités non traduites"

source: Click the Remove Untranslated Units button.
fr: Cliquez sur le bouton Supprimer les unités non traduites .

source: A progress dialog is displayed while untranslated units are removed.
fr: Un petit message s’affiche pendant le traitement.

source: Getting Started
fr: Premiers pas

source: You can use TMXEditor to edit existing TMX files and also to create new TMX files, empty or from CSV/TAB delimited data.
fr: Vous pouvez utiliser TMXEditor pour éditer des fichiers TMX existants ou pour créer de nouveau fichiers TMX, soit vides, soit à partir de fichiers CSV ou TSV.

source: Editing an Existing TMX File
fr: Éditer un fichier TMX existant

source: Convert CSV/TAB Delimited to TMX
fr: Convertir un fichier CSV ou TSV (séparateur Tab) en TMX

source: Search & Replace Text
fr: Remplacer toutes les occurrences d’un texte

source: Follow these steps to perform a global search & replace operation.
fr: Voici les étapes à suivre pour remplacer toutes les occurrences d’un texte dans un fichiers TMX.

source: Click the Replace Text button.
fr: Cliquez sur le bouton Remplacer toutes les occurrences .

source: All exact appearances of the text in Text to Search , or fragments that match the given regular expression, are replaced with the text specified in the Replace With text box.
fr: Toutes les occurrences du texte du champ Recherche , ou tous les fragments correspondant à l’expression régulière, sont remplacés par le texte du champ Remplacer par .

source: In main menu, select Edit Replace Text... ([ Ctrl+F ] on Windows/Linux, [ Cmd+F ] on macOS) or click the Replace Text... button on the top toolbar.
fr: Dans le menu, sélectionnez Édition Remplacer du texte ([ Ctrl+F ] sur Windows/Linux, [ Cmd+F ] sur macOS), ou cliquez sur le bouton Remplacer du texte dans la barre d’outils.

source: Replace Text Dialog
fr: Boîte de dialogue "Remplacer du texte"

source: Enter the text to replace in the Text to Search text box.
fr: Saisissez le texte à remplacer dans le champ Recherche .

source: Enter the replacement text in the Replace With text box.
fr: Saisissez le texte à mettre à la place dans le champ Remplacer par .

source: Use the Language drop-down to select the language column where the replacement should be performed.
fr: Sélectionnez la langue des textes dans laquelle l’opération doit s’effectuer à l’aide de la liste déroulante Langue .

source: Sort Translation Units
fr: Trier les unités de traduction

source: Follow these steps to display the entries of your TMX file sorted on a selected language.
fr: Marche à suivre pour afficher les textes d’un fichier TMX par ordre alphabétique sur une langue donnée.

source: All units will be sorted according to the selected language. To display all units in the original order, reopen the dialog and click the Clear Sorting button.
fr: Les unités triées sur la langue sélectionnée apparaissent dans la fenêtre principale. Pour afficher les unités de traduction dans l’ordre d’origine, ouvrez à nouveau la boîte de dialogue et cliquez sur le bouton Annuler le tri .

source: Data in a TMX file is stored without a particular order. Sometimes it may be useful to sort data according to a given language to facilitate editing.
fr: Dans un fichier TMX, l’ordre des unités de traduction n’est pas significatif. Pour faciliter la navigation et l’édition, il est parfois pratique de trier les textes d’une langue donnée par ordre alphabétique.

source: Follow these steps to sort the content of a TMX file for review.
fr: Voici les étapes à suivre pour trier les textes d’un fichier TMX.

source: In main menu, select View Sort Translation Units option ([ F5 ]) or click on the Sort Translation Units button on the top toolbar.
fr: Dans le menu, sélectionnez Affichage Trier les unités de traduction (touche [ F5 ]), ou cliquez sur le bouton Trier les unités de traduction dans la barre d’outils.

source: Sort Translation Units Dialog
fr: Boîte de dialogue "Trier les unités de traduction"

source: Use the Sort Language drop-down to select the language used for sorting the file.
fr: Sélectionnez la langue à utiliser pour le tri à l’aide de la liste déroulante Langue sur laquelle trier .

source: Select the Sort Descending checkbox if you want the units sorted in descending order. Clear the checkbox otherwise.
fr: Cochez la case Par ordre décroissant si vous souhaitez afficher les unités de traduction par ordre alphabétique inverse. Laissez la case décochée si vous voulez juste l’ordre alphabétique normal.

source: Click the Sort Translation Units button.
fr: Cliquez sur le bouton Trier les unités de traduction .

source: Split TMX File
fr: Découper un fichier TMX

source: Follow these steps to split a TMX file in two or more parts.
fr: Marche à suivre pour découper un fichier TMX en plusieurs morceaux.

source: Sometimes a TMX file may be too big to be processed and splitting it into smaller pieces may help.
fr: L’exploitation ou le traitement d’un fichier TMX volumineux pose parfois problème. Découper ce fichier en plusieurs petits morceaux peut permettre de s’en sortir.

source: In main menu, select File Split TMX File... .
fr: Dans le menu, sélectionnez Fichier Découper un fichier TMX .

source: Split TMX File Dialog
fr: Boîte de dialogue "Découper un fichier TMX"

source: Enter the full name of the file to split in the TMX File box or click the Browse... button to select the file from the file system.
fr: Dans le champ Fichier TMX , saisissez le chemin du fichier à convertir, ou sélectionnez le fichier à l’aide du bouton Parcourir .

source: Select the number of parts in which you want to split the file.
fr: Indiquez en combien de morceaux vous souhaitez découper le fichier.

source: Click the Split TMX File button.
fr: Cliquez sur le bouton Découper le fichier .

source: A progress dialog is displayed while the selected TMX file is split into the indicated number of smaller TMX files that are created in the same folder. The original document is left unchanged.
fr: Un petit message s’affiche pendant le traitement. Les petits fichiers TMX sont créés dans le répertoire du fichier sélectionné. Le traitement ne modifie pas le fichier original.

source: First Registration - Evaluation Request
fr: Premier abonnement / Demande d’évaluation

source: When you open TMXEditor from the official installers for the first time, or when the subscription key is not registered, the following dialog is displayed:
fr: Si vous avez installé TMXEditor à l’aide du programme d’installation officiel, la boîte de dialogue suivante s’ouvre lorsque vous lancez TMXEditor pour la première fois et tant qu’aucune clé d’abonnement n’est enregistrée.

source: Request Received Dialog
fr: Boîte de dialogue confirmant la demande de période d’essai

source: Check your email and register the evaluation key using the instructions shown above.
fr: Allez dans votre messagerie, ouvrez le mail, puis enregistrez la clé d’évaluation comme indiqué ci-dessus.

source: Register Subscription Dialog
fr: Boîte de dialogue "Abonnement"

source: If you have a subscription key, type it in the Subscription Key text box and click the Register Subscription button.
fr: Si vous avez une clé d’abonnement, saisissez-la dans le champ Clé d’abonnement , puis cliquez sur le bouton Enregistrer l’abonnement .

source: On registration success, the main editing screen will be presented.
fr: Si la clé est acceptée, la fenêtre principale de TMXEditor apparaît.

source: If you don't have a subscription key and wish to test the program during 7 days, click the Request Evaluation Key button.
fr: Si vous n’avez pas de clé d’abonnement, vous pouvez demander une période d’essai de 7 jours en cliquant sur le bouton Demander une clé d’évaluation .

source: Request Evaluation Key Dialog
fr: Boîte de dialogue "Demandez votre période d’essai gratuite"

source: Enter the requested data and click the Request Evaluation Key button.
fr: Saisissez les informations demandées, puis cliquez sur le bouton Demander une clé d’évaluation .

source: On success, an email with the requested evaluation key will be sent to the indicated address and the following dialog will be displayed:
fr: Si votre demande est acceptée, la clé d’évaluation vous est envoyée par mail, et la boîte de dialogue suivante apparaît.

source: Subscription Renewal
fr: Renouvellement d’un abonnement

source: You can register a new subscription key before your existing subscription expires.
fr: Vous pouvez enregistrer un nouvel abonnement avant que votre abonnement actuel expire.

source: In main menu, select Help Register Subscription... .
fr: Dans le menu, sélectionnez Aide Abonnement. .

source: If you don't have a subscription key yet, click on the Purchase Subscription button to open Maxprograms Online Store on your internet browser.
fr: Si vous n’avez pas de clé d’abonnement, cliquez sur le bouton Acheter un abonnement pour accéder à la boutique en ligne de Maxprograms dans le navigateur internet.

source: If you have a Subscription Key, type it in the Subscription Key text box and click the Register Subscription button.
fr: Si vous avez une clé d’abonnement, saisissez-la dans le champ Clé d’abonnement , puis cliquez sur le bouton Enregistrer l’abonnement .

source: On registration success, The following dialog appears:
fr: Si la clé est acceptée, la petite boîte de dialogue suivante apparaît :

source: Subscription Registered Dialog
fr: Boîte de dialogue "Abonnement validé"

source: TMX Validation
fr: Validation TMX

source: Most CAT (Computer Aided Translation) tools rely on TMX (Translation Memory eXchange) standard to exchange translation memory data. Unfortunately, some tools produce files that are not valid and others do not accept TMX documents that are correctly formatted.
fr: La plupart des outils de TAO (Traduction Assistée par Ordinateur) s’appuient sur la norme TMX (Translation Memory Echange) pour l’échange des mémoires de traduction. Malheureusement, il y a des outils qui produisent des fichiers TMX non conformes, ou qui n’arrivent pas à lire certains fichiers TMX dont le format est pourtant correct.

source: TMXEditor checks the validity of TMX files against TMX DTD and also verifies if they follow the requirements described in TMX specifications.
fr: TMXEditor permet de vérifier la validité des fichiers TMX par rapport à la DTD et par rapport aux spécifications de la norme TMX.

source: In main menu, select File Validate TMX File... .
fr: Dans le menu, sélectionnez Fichier Valider un fichier TMX .

source: Use the dialog that appears to locate and select the file that you want to validate.
fr: Sélectionnez le fichier à valider à l’aide de la boîte de dialogue.

source: A progress dialog is displayed while the file is analyzed.
fr: Un petit message s’affiche pendant la validation.

source: After checking the TMX file, a dialog with validation results appears.
fr: Le résultat de la validation s’affiche dans une boîte de dialogue.

source: TMXEditor is a cross-platform desktop application designed for editing TMX (Translation Memory eXchange) files on macOS, Linux and Microsoft Windows.
fr: TMXEditor est une application de bureau multiplateforme conçue pour éditer des fichiers TMX (Translation Memory eXchange) sur macOS, Linux et Microsoft Windows.

source: TMXEditor allows editing the content of multilingual TMX files.
fr: TMXEditor permet d’éditer le contenu de fichiers TMX multilingues.

source: TMXEditor on Windows
fr: TMXEditor sur Windows

source: Licenses
fr: Licences

source: TMXEditor uses components from these open source projects:
fr: TMXEditor utilise des composants des projets open source suivants :

source: Published under Eclipse Public License 1.0
fr: Publié sous licence Eclipse Public License 1.0

source: Available from https://github.com/stleary/JSON-java
fr: Disponible à l’adresse https://github.com/stleary/JSON-java

source: Public domain
fr: Publié dans le domaine public

source: Available from https://github.com/rmraya/sdltm
fr: Disponible à l’adresse https://github.com/rmraya/sdltm

source: Available from https://github.com/xerial/sqlite-jdbc
fr: Disponible à l’adresse https://github.com/xerial/sqlite-jdbc

source: Published under Apache License
fr: Publié sous Licence Apache

source: Available from https://www.maxprograms.com/products/tmxvalidator.html
fr: Disponible à l’adresse https://www.maxprograms.com/products/tmxvalidator.html

source: Available from https://github.com/rmraya/TypesXML
fr: Disponible à l’adresse https://github.com/rmraya/TypesXML

source: Available from https://github.com/rmraya/XMLJava
fr: Disponible à l’adresse https://github.com/rmraya/XMLJava

source: Available from https://www.electronjs.org/
fr: Disponible à l’adresse https://www.electronjs.org/

source: Published under MIT License
fr: Publié sous Licence MIT

source: Available from https://adoptium.net/
fr: Disponible à l’adresse https://adoptium.net

source: Published under GPL with CLASSPATH Exception
fr: Publié sous licence GPL with Classpath Exception

source: Available from https://github.com/rmraya/BCP47J
fr: Disponible à l’adresse https://github.com/rmraya/BCP47J

source: Maintenance Tasks
fr: Tâches de maintenance

source: TMXEditor maintenance options are
fr: Voici la liste des tâches de maintenance que TMXEditor peut effectuer :

source: Set Attributes, Properties and Notes at File Level
fr: Définir des attributs, des propriétés et des notes au niveau du fichier

source: Subscriptions
fr: Abonnements

source: TMXEditor is available in two modes:
fr: TMXEditor est disponible :

source: Differences Summary
fr: Différences entre les deux formats

source: Source Code
fr: sous forme de code source, ou

source: Subscription Based
fr: Abonnement

source: Ready To Use Installers
fr: Programme d’installation prêt à l’emploi

source: No
fr: Non

source: Yes
fr: Oui

source: Notarized macOS launcher
fr: App macOS authentifiée par Apple

source: Signed launcher and installer for Windows
fr: Installeur et programme Windows signés numériquement

source: Associate app with .tmx extension on Windows and macOS
fr: Association de l’extension de fichier .tmx sur Windows et macOS

source: Restricted Features
fr: Limitation fonctionnelle

source: None
fr: Aucune

source: Technical Support
fr: Support technique

source: Peer support at Groups.io
fr: Par la communauté sur Groups.io

source: Yearly Subscriptions for installers and support
fr: en abonnement annuel avec programme d’installation et support technique.

source: Direct email at tech@maxprograms.com
fr: Par l’éditeur à l’adresse mail tech@maxprograms.com

source: Source code of TMXEditor is free. Anyone can download the source code from Github.com , compile, modify and use it at no cost in compliance with the accompanying license terms.
fr: Le code source de TMXEditor est libre. Vous pouvez le télécharger sur Github.com , le compiler, le modifier et l’utiliser gratuitement, conformément aux termes de la licence qui l’accompagne.

source: Ready to use installers and technical support for TMXEditor are available as yearly subscriptions at Maxprograms Online Store .
fr: La boutique en ligne de Maxprograms vend sous forme d’abonnement annuel un programme d’installation prêt à l’emploi ainsi que du support technique pour TMXEditor

source: The version of TMXEditor included in the official installers can be used at no cost for 7 days requesting a free Evaluation Key.
fr: Vous pouvez demander une période d’essai et utiliser gratuitement pendant 7 jours la version de TMXEditor incluse dans le programme d’installation officiel.

source: Subscription keys cannot be shared or transferred to different machines.
fr: Les clés d’abonnement ne peuvent pas être partagées ni transférées d’un ordinateur à l’autre.

source: Supported Platforms
fr: Plateformes compatibles

source: TMXEditor works on these Operating Systems:
fr: Le logiciel TMXEditor fonctionne sur les OS suivants :

source: Microsoft Windows 10 and 11
fr: Microsoft Windows 10 et 11

source: macOS Big Sur (11.0), Monterey (12.0), Ventura (13.0), Sonoma (14.0) and Sequoia (15.0)
fr: macOS Big Sur (11.0), Monterey (12.0), Ventura (13.0), Sonoma (14.0) et Sequoia (15.0)

source: Linux (with GNOME Desktop Manager)
fr: Linux (avec le gestionnaire de bureau GNOME)
